package task1;


// Создайте класс, представляющий собой автомобиль.
// У автомобиля должны быть поля для модели, года выпуска и пробега.
// Напишите методы для установки и получения значений этих полей.
// Создайте объекты класса автомобиль и выведите их поля на экран.

public class Car {
//    private String model;
//    private int year;
//    private int mileage;

    String model;
    int year;
    int mileage;

    public void printModel() {
        System.out.println("Модель машины: " + model);
    }

//    public String getModel() {
//        return model;
//    }
//
//
//    public void setModel(String model) {
//        this.model = model;
//    }
//
//    public void setYear(int year) {
//        this.year = year;
//    }
//
//    public int getYear() {
//        return year;
//    }
//
//    public void setMileage(int mileage) {
//        this.mileage = mileage;
//    }
//
//    public int getMileage() {
//        return mileage;
//    }
}